Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/flexcom.h
/* LIN mode */
#define FLEX_US_CSR_LIN_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_CSR_LIN) Register Mask  */


/* -------- FLEX_US_RHR : (FLEXCOM Offset: 0x218) ( R/ 32) USART Receive Holding Register -------- */
#define FLEX_US_RHR_RXCHR_Pos                 _U_(0)                                               /**< (FLEX_US_RHR) Received Character Position */
#define FLEX_US_RHR_RXCHR_Msk                 (_U_(0x1FF) << FLEX_US_RHR_RXCHR_Pos)                /**< (FLEX_US_RHR) Received Character Mask */
#define FLEX_US_RHR_RXCHR(value)              (FLEX_US_RHR_RXCHR_Msk & ((value) << FLEX_US_RHR_RXCHR_Pos))
#define FLEX_US_RHR_RXSYNH_Pos                _U_(15)                                              /**< (FLEX_US_RHR) Received Sync Position */
#define FLEX_US_RHR_RXSYNH_Msk                (_U_(0x1) << FLEX_US_RHR_RXSYNH_Pos)                 /**< (FLEX_US_RHR) Received Sync Mask */
#define FLEX_US_RHR_RXSYNH(value)             (FLEX_US_RHR_RXSYNH_Msk & ((value) << FLEX_US_RHR_RXSYNH_Pos))
#define FLEX_US_RHR_Msk                       _U_(0x000081FF)                                      /**< (FLEX_US_RHR) Register Mask  */

/* FIFO_MULTI_DATA mode */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR0_Pos _U_(0)                                               /**< (FLEX_US_RHR) Received Character Position */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR0_Msk (_U_(0xFF) << FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR0_Pos) /**< (FLEX_US_RHR) Received Character Mask */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR0(value) (FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR0_Msk & ((value) << FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR0_Pos))
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR1_Pos _U_(8)                                               /**< (FLEX_US_RHR) Received Character Position */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR1_Msk (_U_(0xFF) << FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR1_Pos) /**< (FLEX_US_RHR) Received Character Mask */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR1(value) (FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR1_Msk & ((value) << FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR1_Pos))
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR2_Pos _U_(16)                                              /**< (FLEX_US_RHR) Received Character Position */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR2_Msk (_U_(0xFF) << FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR2_Pos) /**< (FLEX_US_RHR) Received Character Mask */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR2(value) (FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR2_Msk & ((value) << FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR2_Pos))
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR3_Pos _U_(24)                                              /**< (FLEX_US_RHR) Received Character Position */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR3_Msk (_U_(0xFF) << FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR3_Pos) /**< (FLEX_US_RHR) Received Character Mask */
#define FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR3(value) (FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR3_Msk & ((value) << FLEX_US_RHR_FIFO_MULTI_DATA_RXCHR3_Pos))
#define FLEX_US_RHR_FIFO_MULTI_DATA_Msk       _U_(0xFFFFFFFF)                                       /**< (FLEX_US_RHR_FIFO_MULTI_DATA) Register Mask  */


/* -------- FLEX_US_THR : (FLEXCOM Offset: 0x21C) ( /W 32) USART Transmit Holding Register -------- */
#define FLEX_US_THR_TXCHR_Pos                 _U_(0)                                               /**< (FLEX_US_THR) Character to be Transmitted Position */
#define FLEX_US_THR_TXCHR_Msk                 (_U_(0x1FF) << FLEX_US_THR_TXCHR_Pos)                /**< (FLEX_US_THR) Character to be Transmitted Mask */
#define FLEX_US_THR_TXCHR(value)              (FLEX_US_THR_TXCHR_Msk & ((value) << FLEX_US_THR_TXCHR_Pos))
#define FLEX_US_THR_TXSYNH_Pos                _U_(15)                                              /**< (FLEX_US_THR) Sync Field to be Transmitted Position */
#define FLEX_US_THR_TXSYNH_Msk                (_U_(0x1) << FLEX_US_THR_TXSYNH_Pos)                 /**< (FLEX_US_THR) Sync Field to be Transmitted Mask */
#define FLEX_US_THR_TXSYNH(value)             (FLEX_US_THR_TXSYNH_Msk & ((value) << FLEX_US_THR_TXSYNH_Pos))
#define FLEX_US_THR_Msk                       _U_(0x000081FF)                                      /**< (FLEX_US_THR) Register Mask  */

/* FIFO_MULTI_DATA mode */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR0_Pos _U_(0)                                               /**< (FLEX_US_THR) Character to be Transmitted Position */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR0_Msk (_U_(0xFF) << FLEX_US_THR_FIFO_MULTI_DATA_TXCHR0_Pos) /**< (FLEX_US_THR) Character to be Transmitted Mask */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR0(value) (FLEX_US_THR_FIFO_MULTI_DATA_TXCHR0_Msk & ((value) << FLEX_US_THR_FIFO_MULTI_DATA_TXCHR0_Pos))
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR1_Pos _U_(8)                                               /**< (FLEX_US_THR) Character to be Transmitted Position */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR1_Msk (_U_(0xFF) << FLEX_US_THR_FIFO_MULTI_DATA_TXCHR1_Pos) /**< (FLEX_US_THR) Character to be Transmitted Mask */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR1(value) (FLEX_US_THR_FIFO_MULTI_DATA_TXCHR1_Msk & ((value) << FLEX_US_THR_FIFO_MULTI_DATA_TXCHR1_Pos))
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR2_Pos _U_(16)                                              /**< (FLEX_US_THR) Character to be Transmitted Position */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR2_Msk (_U_(0xFF) << FLEX_US_THR_FIFO_MULTI_DATA_TXCHR2_Pos) /**< (FLEX_US_THR) Character to be Transmitted Mask */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR2(value) (FLEX_US_THR_FIFO_MULTI_DATA_TXCHR2_Msk & ((value) << FLEX_US_THR_FIFO_MULTI_DATA_TXCHR2_Pos))
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR3_Pos _U_(24)                                              /**< (FLEX_US_THR) Character to be Transmitted Position */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR3_Msk (_U_(0xFF) << FLEX_US_THR_FIFO_MULTI_DATA_TXCHR3_Pos) /**< (FLEX_US_THR) Character to be Transmitted Mask */
#define FLEX_US_THR_FIFO_MULTI_DATA_TXCHR3(value) (FLEX_US_THR_FIFO_MULTI_DATA_TXCHR3_Msk & ((value) << FLEX_US_THR_FIFO_MULTI_DATA_TXCHR3_Pos))
#define FLEX_US_THR_FIFO_MULTI_DATA_Msk       _U_(0xFFFFFFFF)                                       /**< (FLEX_US_THR_FIFO_MULTI_DATA) Register Mask  */


/* -------- FLEX_US_BRGR : (FLEXCOM Offset: 0x220) (R/W 32) USART Baud Rate Generator Register -------- */
#define FLEX_US_BRGR_CD_Pos                   _U_(0)                                               /**< (FLEX_US_BRGR) Clock Divider Position */
#define FLEX_US_BRGR_CD_Msk                   (_U_(0xFFFF) << FLEX_US_BRGR_CD_Pos)                 /**< (FLEX_US_BRGR) Clock Divider Mask */
#define FLEX_US_BRGR_CD(value)                (FLEX_US_BRGR_CD_Msk & ((value) << FLEX_US_BRGR_CD_Pos))
#define FLEX_US_BRGR_FP_Pos                   _U_(16)                                              /**< (FLEX_US_BRGR) Fractional Part Position */
#define FLEX_US_BRGR_FP_Msk                   (_U_(0x7) << FLEX_US_BRGR_FP_Pos)                    /**< (FLEX_US_BRGR) Fractional Part Mask */
#define FLEX_US_BRGR_FP(value)                (FLEX_US_BRGR_FP_Msk & ((value) << FLEX_US_BRGR_FP_Pos))
#define FLEX_US_BRGR_Msk                      _U_(0x0007FFFF)                                      /**< (FLEX_US_BRGR) Register Mask  */


/* -------- FLEX_US_RTOR : (FLEXCOM Offset: 0x224) (R/W 32) USART Receiver Timeout Register -------- */
#define FLEX_US_RTOR_TO_Pos                   _U_(0)                                               /**< (FLEX_US_RTOR) Timeout Value Position */
#define FLEX_US_RTOR_TO_Msk                   (_U_(0x1FFFF) << FLEX_US_RTOR_TO_Pos)                /**< (FLEX_US_RTOR) Timeout Value Mask */
#define FLEX_US_RTOR_TO(value)                (FLEX_US_RTOR_TO_Msk & ((value) << FLEX_US_RTOR_TO_Pos))
#define FLEX_US_RTOR_Msk                      _U_(0x0001FFFF)                                      /**< (FLEX_US_RTOR) Register Mask  */


/* -------- FLEX_US_TTGR : (FLEXCOM Offset: 0x228) (R/W 32) USART Transmitter Timeguard Register -------- */
#define FLEX_US_TTGR_TG_Pos                   _U_(0)                                               /**< (FLEX_US_TTGR) Timeguard Value Position */
#define FLEX_US_TTGR_TG_Msk                   (_U_(0xFF) << FLEX_US_TTGR_TG_Pos)                   /**< (FLEX_US_TTGR) Timeguard Value Mask */
#define FLEX_US_TTGR_TG(value)                (FLEX_US_TTGR_TG_Msk & ((value) << FLEX_US_TTGR_TG_Pos))
#define FLEX_US_TTGR_Msk                      _U_(0x000000FF)                                      /**< (FLEX_US_TTGR) Register Mask  */


/* -------- FLEX_US_FIDI : (FLEXCOM Offset: 0x240) (R/W 32) USART FI DI Ratio Register -------- */
#define FLEX_US_FIDI_FI_DI_RATIO_Pos          _U_(0)                                               /**< (FLEX_US_FIDI) FI Over DI Ratio Value Position */
#define FLEX_US_FIDI_FI_DI_RATIO_Msk          (_U_(0xFFFF) << FLEX_US_FIDI_FI_DI_RATIO_Pos)        /**< (FLEX_US_FIDI) FI Over DI Ratio Value Mask */
#define FLEX_US_FIDI_FI_DI_RATIO(value)       (FLEX_US_FIDI_FI_DI_RATIO_Msk & ((value) << FLEX_US_FIDI_FI_DI_RATIO_Pos))
#define FLEX_US_FIDI_Msk                      _U_(0x0000FFFF)                                      /**< (FLEX_US_FIDI) Register Mask  */


/* -------- FLEX_US_NER : (FLEXCOM Offset: 0x244) ( R/ 32) USART Number of Errors Register -------- */
#define FLEX_US_NER_NB_ERRORS_Pos             _U_(0)                                               /**< (FLEX_US_NER) Number of Errors Position */
#define FLEX_US_NER_NB_ERRORS_Msk             (_U_(0xFF) << FLEX_US_NER_NB_ERRORS_Pos)             /**< (FLEX_US_NER) Number of Errors Mask */
#define FLEX_US_NER_NB_ERRORS(value)          (FLEX_US_NER_NB_ERRORS_Msk & ((value) << FLEX_US_NER_NB_ERRORS_Pos))
#define FLEX_US_NER_Msk                       _U_(0x000000FF)                                      /**< (FLEX_US_NER) Register Mask  */


/* -------- FLEX_US_IF : (FLEXCOM Offset: 0x24C) (R/W 32) USART IrDA Filter Register -------- */
#define FLEX_US_IF_IRDA_FILTER_Pos            _U_(0)                                               /**< (FLEX_US_IF) IrDA Filter Position */
#define FLEX_US_IF_IRDA_FILTER_Msk            (_U_(0xFF) << FLEX_US_IF_IRDA_FILTER_Pos)            /**< (FLEX_US_IF) IrDA Filter Mask */
#define FLEX_US_IF_IRDA_FILTER(value)         (FLEX_US_IF_IRDA_FILTER_Msk & ((value) << FLEX_US_IF_IRDA_FILTER_Pos))
#define FLEX_US_IF_Msk                        _U_(0x000000FF)                                      /**< (FLEX_US_IF) Register Mask  */


/* -------- FLEX_US_MAN : (FLEXCOM Offset: 0x250) (R/W 32) USART Manchester Configuration Register -------- */
#define FLEX_US_MAN_TX_PL_Pos                 _U_(0)                                               /**< (FLEX_US_MAN) Transmitter Preamble Length Position */
#define FLEX_US_MAN_TX_PL_Msk                 (_U_(0xF) << FLEX_US_MAN_TX_PL_Pos)                  /**< (FLEX_US_MAN) Transmitter Preamble Length Mask */
#define FLEX_US_MAN_TX_PL(value)              (FLEX_US_MAN_TX_PL_Msk & ((value) << FLEX_US_MAN_TX_PL_Pos))
#define FLEX_US_MAN_TX_PP_Pos                 _U_(8)                                               /**< (FLEX_US_MAN) Transmitter Preamble Pattern Position */
#define FLEX_US_MAN_TX_PP_Msk                 (_U_(0x3) << FLEX_US_MAN_TX_PP_Pos)                  /**< (FLEX_US_MAN) Transmitter Preamble Pattern Mask */
#define FLEX_US_MAN_TX_PP(value)              (FLEX_US_MAN_TX_PP_Msk & ((value) << FLEX_US_MAN_TX_PP_Pos))
#define   FLEX_US_MAN_TX_PP_ALL_ONE_Val       _U_(0x0)                                             /**< (FLEX_US_MAN) The preamble is composed of '1's  */
#define   FLEX_US_MAN_TX_PP_ALL_ZERO_Val      _U_(0x1)                                             /**< (FLEX_US_MAN) The preamble is composed of '0's  */
#define   FLEX_US_MAN_TX_PP_ZERO_ONE_Val      _U_(0x2)                                             /**< (FLEX_US_MAN) The preamble is composed of '01's  */
#define   FLEX_US_MAN_TX_PP_ONE_ZERO_Val      _U_(0x3)                                             /**< (FLEX_US_MAN) The preamble is composed of '10's  */
#define FLEX_US_MAN_TX_PP_ALL_ONE             (FLEX_US_MAN_TX_PP_ALL_ONE_Val << FLEX_US_MAN_TX_PP_Pos) /**< (FLEX_US_MAN) The preamble is composed of '1's Position  */
#define FLEX_US_MAN_TX_PP_ALL_ZERO            (FLEX_US_MAN_TX_PP_ALL_ZERO_Val << FLEX_US_MAN_TX_PP_Pos) /**< (FLEX_US_MAN) The preamble is composed of '0's Position  */
#define FLEX_US_MAN_TX_PP_ZERO_ONE            (FLEX_US_MAN_TX_PP_ZERO_ONE_Val << FLEX_US_MAN_TX_PP_Pos) /**< (FLEX_US_MAN) The preamble is composed of '01's Position  */
#define FLEX_US_MAN_TX_PP_ONE_ZERO            (FLEX_US_MAN_TX_PP_ONE_ZERO_Val << FLEX_US_MAN_TX_PP_Pos) /**< (FLEX_US_MAN) The preamble is composed of '10's Position  */
#define FLEX_US_MAN_TX_MPOL_Pos               _U_(12)                                              /**< (FLEX_US_MAN) Transmitter Manchester Polarity Position */
#define FLEX_US_MAN_TX_MPOL_Msk               (_U_(0x1) << FLEX_US_MAN_TX_MPOL_Pos)                /**< (FLEX_US_MAN) Transmitter Manchester Polarity Mask */
#define FLEX_US_MAN_TX_MPOL(value)            (FLEX_US_MAN_TX_MPOL_Msk & ((value) << FLEX_US_MAN_TX_MPOL_Pos))
#define FLEX_US_MAN_RX_PL_Pos                 _U_(16)                                              /**< (FLEX_US_MAN) Receiver Preamble Length Position */
#define FLEX_US_MAN_RX_PL_Msk                 (_U_(0xF) << FLEX_US_MAN_RX_PL_Pos)                  /**< (FLEX_US_MAN) Receiver Preamble Length Mask */
#define FLEX_US_MAN_RX_PL(value)              (FLEX_US_MAN_RX_PL_Msk & ((value) << FLEX_US_MAN_RX_PL_Pos))
#define FLEX_US_MAN_RX_PP_Pos                 _U_(24)                                              /**< (FLEX_US_MAN) Receiver Preamble Pattern detected Position */
#define FLEX_US_MAN_RX_PP_Msk                 (_U_(0x3) << FLEX_US_MAN_RX_PP_Pos)                  /**< (FLEX_US_MAN) Receiver Preamble Pattern detected Mask */
#define FLEX_US_MAN_RX_PP(value)              (FLEX_US_MAN_RX_PP_Msk & ((value) << FLEX_US_MAN_RX_PP_Pos))
#define   FLEX_US_MAN_RX_PP_ALL_ONE_Val       _U_(0x0)                                             /**< (FLEX_US_MAN) The preamble is composed of '1's  */
#define   FLEX_US_MAN_RX_PP_ALL_ZERO_Val      _U_(0x1)                                             /**< (FLEX_US_MAN) The preamble is composed of '0's  */
#define   FLEX_US_MAN_RX_PP_ZERO_ONE_Val      _U_(0x2)                                             /**< (FLEX_US_MAN) The preamble is composed of '01's  */
#define   FLEX_US_MAN_RX_PP_ONE_ZERO_Val      _U_(0x3)                                             /**< (FLEX_US_MAN) The preamble is composed of '10's  */
#define FLEX_US_MAN_RX_PP_ALL_ONE             (FLEX_US_MAN_RX_PP_ALL_ONE_Val << FLEX_US_MAN_RX_PP_Pos) /**< (FLEX_US_MAN) The preamble is composed of '1's Position  */
#define FLEX_US_MAN_RX_PP_ALL_ZERO            (FLEX_US_MAN_RX_PP_ALL_ZERO_Val << FLEX_US_MAN_RX_PP_Pos) /**< (FLEX_US_MAN) The preamble is composed of '0's Position  */
#define FLEX_US_MAN_RX_PP_ZERO_ONE            (FLEX_US_MAN_RX_PP_ZERO_ONE_Val << FLEX_US_MAN_RX_PP_Pos) /**< (FLEX_US_MAN) The preamble is composed of '01's Position  */
#define FLEX_US_MAN_RX_PP_ONE_ZERO            (FLEX_US_MAN_RX_PP_ONE_ZERO_Val << FLEX_US_MAN_RX_PP_Pos) /**< (FLEX_US_MAN) The preamble is composed of '10's Position  */
#define FLEX_US_MAN_RX_MPOL_Pos               _U_(28)                                              /**< (FLEX_US_MAN) Receiver Manchester Polarity Position */
#define FLEX_US_MAN_RX_MPOL_Msk               (_U_(0x1) << FLEX_US_MAN_RX_MPOL_Pos)                /**< (FLEX_US_MAN) Receiver Manchester Polarity Mask */
#define FLEX_US_MAN_RX_MPOL(value)            (FLEX_US_MAN_RX_MPOL_Msk & ((value) << FLEX_US_MAN_RX_MPOL_Pos))
#define FLEX_US_MAN_ONE_Pos                   _U_(29)                                              /**< (FLEX_US_MAN) Must Be Set to 1 Position */
#define FLEX_US_MAN_ONE_Msk                   (_U_(0x1) << FLEX_US_MAN_ONE_Pos)                    /**< (FLEX_US_MAN) Must Be Set to 1 Mask */
#define FLEX_US_MAN_ONE(value)                (FLEX_US_MAN_ONE_Msk & ((value) << FLEX_US_MAN_ONE_Pos))
#define FLEX_US_MAN_DRIFT_Pos                 _U_(30)                                              /**< (FLEX_US_MAN) Drift Compensation Position */
#define FLEX_US_MAN_DRIFT_Msk                 (_U_(0x1) << FLEX_US_MAN_DRIFT_Pos)                  /**< (FLEX_US_MAN) Drift Compensation Mask */
#define FLEX_US_MAN_DRIFT(value)              (FLEX_US_MAN_DRIFT_Msk & ((value) << FLEX_US_MAN_DRIFT_Pos))
#define FLEX_US_MAN_RXIDLEV_Pos               _U_(31)                                              /**< (FLEX_US_MAN) Receiver Idle Value Position */
#define FLEX_US_MAN_RXIDLEV_Msk               (_U_(0x1) << FLEX_US_MAN_RXIDLEV_Pos)                /**< (FLEX_US_MAN) Receiver Idle Value Mask */
#define FLEX_US_MAN_RXIDLEV(value)            (FLEX_US_MAN_RXIDLEV_Msk & ((value) << FLEX_US_MAN_RXIDLEV_Pos))
#define FLEX_US_MAN_Msk                       _U_(0xF30F130F)                                      /**< (FLEX_US_MAN) Register Mask  */


