Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/flexcom.h
/* -------- FLEX_SPI_WPSR : (FLEXCOM Offset: 0x4E8) ( R/ 32) SPI Write Protection Status Register -------- */
#define FLEX_SPI_WPSR_WPVS_Pos                _U_(0)                                               /**< (FLEX_SPI_WPSR) Write Protection Violation Status Position */
#define FLEX_SPI_WPSR_WPVS_Msk                (_U_(0x1) << FLEX_SPI_WPSR_WPVS_Pos)                 /**< (FLEX_SPI_WPSR) Write Protection Violation Status Mask */
#define FLEX_SPI_WPSR_WPVS(value)             (FLEX_SPI_WPSR_WPVS_Msk & ((value) << FLEX_SPI_WPSR_WPVS_Pos))
#define FLEX_SPI_WPSR_WPVSRC_Pos              _U_(8)                                               /**< (FLEX_SPI_WPSR) Write Protection Violation Source Position */
#define FLEX_SPI_WPSR_WPVSRC_Msk              (_U_(0xFF) << FLEX_SPI_WPSR_WPVSRC_Pos)              /**< (FLEX_SPI_WPSR) Write Protection Violation Source Mask */
#define FLEX_SPI_WPSR_WPVSRC(value)           (FLEX_SPI_WPSR_WPVSRC_Msk & ((value) << FLEX_SPI_WPSR_WPVSRC_Pos))
#define FLEX_SPI_WPSR_Msk                     _U_(0x0000FF01)                                      /**< (FLEX_SPI_WPSR) Register Mask  */


/* -------- FLEX_TWI_CR : (FLEXCOM Offset: 0x600) ( /W 32) TWI Control Register -------- */
#define FLEX_TWI_CR_START_Pos                 _U_(0)                                               /**< (FLEX_TWI_CR) Send a START Condition Position */
#define FLEX_TWI_CR_START_Msk                 (_U_(0x1) << FLEX_TWI_CR_START_Pos)                  /**< (FLEX_TWI_CR) Send a START Condition Mask */
#define FLEX_TWI_CR_START(value)              (FLEX_TWI_CR_START_Msk & ((value) << FLEX_TWI_CR_START_Pos))
#define FLEX_TWI_CR_STOP_Pos                  _U_(1)                                               /**< (FLEX_TWI_CR) Send a STOP Condition Position */
#define FLEX_TWI_CR_STOP_Msk                  (_U_(0x1) << FLEX_TWI_CR_STOP_Pos)                   /**< (FLEX_TWI_CR) Send a STOP Condition Mask */
#define FLEX_TWI_CR_STOP(value)               (FLEX_TWI_CR_STOP_Msk & ((value) << FLEX_TWI_CR_STOP_Pos))
#define FLEX_TWI_CR_MSEN_Pos                  _U_(2)                                               /**< (FLEX_TWI_CR) TWI Master Mode Enabled Position */
#define FLEX_TWI_CR_MSEN_Msk                  (_U_(0x1) << FLEX_TWI_CR_MSEN_Pos)                   /**< (FLEX_TWI_CR) TWI Master Mode Enabled Mask */
#define FLEX_TWI_CR_MSEN(value)               (FLEX_TWI_CR_MSEN_Msk & ((value) << FLEX_TWI_CR_MSEN_Pos))
#define FLEX_TWI_CR_MSDIS_Pos                 _U_(3)                                               /**< (FLEX_TWI_CR) TWI Master Mode Disabled Position */
#define FLEX_TWI_CR_MSDIS_Msk                 (_U_(0x1) << FLEX_TWI_CR_MSDIS_Pos)                  /**< (FLEX_TWI_CR) TWI Master Mode Disabled Mask */
#define FLEX_TWI_CR_MSDIS(value)              (FLEX_TWI_CR_MSDIS_Msk & ((value) << FLEX_TWI_CR_MSDIS_Pos))
#define FLEX_TWI_CR_SVEN_Pos                  _U_(4)                                               /**< (FLEX_TWI_CR) TWI Slave Mode Enabled Position */
#define FLEX_TWI_CR_SVEN_Msk                  (_U_(0x1) << FLEX_TWI_CR_SVEN_Pos)                   /**< (FLEX_TWI_CR) TWI Slave Mode Enabled Mask */
#define FLEX_TWI_CR_SVEN(value)               (FLEX_TWI_CR_SVEN_Msk & ((value) << FLEX_TWI_CR_SVEN_Pos))
#define FLEX_TWI_CR_SVDIS_Pos                 _U_(5)                                               /**< (FLEX_TWI_CR) TWI Slave Mode Disabled Position */
#define FLEX_TWI_CR_SVDIS_Msk                 (_U_(0x1) << FLEX_TWI_CR_SVDIS_Pos)                  /**< (FLEX_TWI_CR) TWI Slave Mode Disabled Mask */
#define FLEX_TWI_CR_SVDIS(value)              (FLEX_TWI_CR_SVDIS_Msk & ((value) << FLEX_TWI_CR_SVDIS_Pos))
#define FLEX_TWI_CR_QUICK_Pos                 _U_(6)                                               /**< (FLEX_TWI_CR) SMBus Quick Command Position */
#define FLEX_TWI_CR_QUICK_Msk                 (_U_(0x1) << FLEX_TWI_CR_QUICK_Pos)                  /**< (FLEX_TWI_CR) SMBus Quick Command Mask */
#define FLEX_TWI_CR_QUICK(value)              (FLEX_TWI_CR_QUICK_Msk & ((value) << FLEX_TWI_CR_QUICK_Pos))
#define FLEX_TWI_CR_SWRST_Pos                 _U_(7)                                               /**< (FLEX_TWI_CR) Software Reset Position */
#define FLEX_TWI_CR_SWRST_Msk                 (_U_(0x1) << FLEX_TWI_CR_SWRST_Pos)                  /**< (FLEX_TWI_CR) Software Reset Mask */
#define FLEX_TWI_CR_SWRST(value)              (FLEX_TWI_CR_SWRST_Msk & ((value) << FLEX_TWI_CR_SWRST_Pos))
#define FLEX_TWI_CR_HSEN_Pos                  _U_(8)                                               /**< (FLEX_TWI_CR) TWI High-Speed Mode Enabled Position */
#define FLEX_TWI_CR_HSEN_Msk                  (_U_(0x1) << FLEX_TWI_CR_HSEN_Pos)                   /**< (FLEX_TWI_CR) TWI High-Speed Mode Enabled Mask */
#define FLEX_TWI_CR_HSEN(value)               (FLEX_TWI_CR_HSEN_Msk & ((value) << FLEX_TWI_CR_HSEN_Pos))
#define FLEX_TWI_CR_HSDIS_Pos                 _U_(9)                                               /**< (FLEX_TWI_CR) TWI High-Speed Mode Disabled Position */
#define FLEX_TWI_CR_HSDIS_Msk                 (_U_(0x1) << FLEX_TWI_CR_HSDIS_Pos)                  /**< (FLEX_TWI_CR) TWI High-Speed Mode Disabled Mask */
#define FLEX_TWI_CR_HSDIS(value)              (FLEX_TWI_CR_HSDIS_Msk & ((value) << FLEX_TWI_CR_HSDIS_Pos))
#define FLEX_TWI_CR_SMBEN_Pos                 _U_(10)                                              /**< (FLEX_TWI_CR) SMBus Mode Enabled Position */
#define FLEX_TWI_CR_SMBEN_Msk                 (_U_(0x1) << FLEX_TWI_CR_SMBEN_Pos)                  /**< (FLEX_TWI_CR) SMBus Mode Enabled Mask */
#define FLEX_TWI_CR_SMBEN(value)              (FLEX_TWI_CR_SMBEN_Msk & ((value) << FLEX_TWI_CR_SMBEN_Pos))
#define FLEX_TWI_CR_SMBDIS_Pos                _U_(11)                                              /**< (FLEX_TWI_CR) SMBus Mode Disabled Position */
#define FLEX_TWI_CR_SMBDIS_Msk                (_U_(0x1) << FLEX_TWI_CR_SMBDIS_Pos)                 /**< (FLEX_TWI_CR) SMBus Mode Disabled Mask */
#define FLEX_TWI_CR_SMBDIS(value)             (FLEX_TWI_CR_SMBDIS_Msk & ((value) << FLEX_TWI_CR_SMBDIS_Pos))
#define FLEX_TWI_CR_PECEN_Pos                 _U_(12)                                              /**< (FLEX_TWI_CR) Packet Error Checking Enable Position */
#define FLEX_TWI_CR_PECEN_Msk                 (_U_(0x1) << FLEX_TWI_CR_PECEN_Pos)                  /**< (FLEX_TWI_CR) Packet Error Checking Enable Mask */
#define FLEX_TWI_CR_PECEN(value)              (FLEX_TWI_CR_PECEN_Msk & ((value) << FLEX_TWI_CR_PECEN_Pos))
#define FLEX_TWI_CR_PECDIS_Pos                _U_(13)                                              /**< (FLEX_TWI_CR) Packet Error Checking Disable Position */
#define FLEX_TWI_CR_PECDIS_Msk                (_U_(0x1) << FLEX_TWI_CR_PECDIS_Pos)                 /**< (FLEX_TWI_CR) Packet Error Checking Disable Mask */
#define FLEX_TWI_CR_PECDIS(value)             (FLEX_TWI_CR_PECDIS_Msk & ((value) << FLEX_TWI_CR_PECDIS_Pos))
#define FLEX_TWI_CR_PECRQ_Pos                 _U_(14)                                              /**< (FLEX_TWI_CR) PEC Request Position */
#define FLEX_TWI_CR_PECRQ_Msk                 (_U_(0x1) << FLEX_TWI_CR_PECRQ_Pos)                  /**< (FLEX_TWI_CR) PEC Request Mask */
#define FLEX_TWI_CR_PECRQ(value)              (FLEX_TWI_CR_PECRQ_Msk & ((value) << FLEX_TWI_CR_PECRQ_Pos))
#define FLEX_TWI_CR_CLEAR_Pos                 _U_(15)                                              /**< (FLEX_TWI_CR) Bus CLEAR Command Position */
#define FLEX_TWI_CR_CLEAR_Msk                 (_U_(0x1) << FLEX_TWI_CR_CLEAR_Pos)                  /**< (FLEX_TWI_CR) Bus CLEAR Command Mask */
#define FLEX_TWI_CR_CLEAR(value)              (FLEX_TWI_CR_CLEAR_Msk & ((value) << FLEX_TWI_CR_CLEAR_Pos))
#define FLEX_TWI_CR_ACMEN_Pos                 _U_(16)                                              /**< (FLEX_TWI_CR) Alternative Command Mode Enable Position */
#define FLEX_TWI_CR_ACMEN_Msk                 (_U_(0x1) << FLEX_TWI_CR_ACMEN_Pos)                  /**< (FLEX_TWI_CR) Alternative Command Mode Enable Mask */
#define FLEX_TWI_CR_ACMEN(value)              (FLEX_TWI_CR_ACMEN_Msk & ((value) << FLEX_TWI_CR_ACMEN_Pos))
#define FLEX_TWI_CR_ACMDIS_Pos                _U_(17)                                              /**< (FLEX_TWI_CR) Alternative Command Mode Disable Position */
#define FLEX_TWI_CR_ACMDIS_Msk                (_U_(0x1) << FLEX_TWI_CR_ACMDIS_Pos)                 /**< (FLEX_TWI_CR) Alternative Command Mode Disable Mask */
#define FLEX_TWI_CR_ACMDIS(value)             (FLEX_TWI_CR_ACMDIS_Msk & ((value) << FLEX_TWI_CR_ACMDIS_Pos))
#define FLEX_TWI_CR_THRCLR_Pos                _U_(24)                                              /**< (FLEX_TWI_CR) Transmit Holding Register Clear Position */
#define FLEX_TWI_CR_THRCLR_Msk                (_U_(0x1) << FLEX_TWI_CR_THRCLR_Pos)                 /**< (FLEX_TWI_CR) Transmit Holding Register Clear Mask */
#define FLEX_TWI_CR_THRCLR(value)             (FLEX_TWI_CR_THRCLR_Msk & ((value) << FLEX_TWI_CR_THRCLR_Pos))
#define FLEX_TWI_CR_LOCKCLR_Pos               _U_(26)                                              /**< (FLEX_TWI_CR) Lock Clear Position */
#define FLEX_TWI_CR_LOCKCLR_Msk               (_U_(0x1) << FLEX_TWI_CR_LOCKCLR_Pos)                /**< (FLEX_TWI_CR) Lock Clear Mask */
#define FLEX_TWI_CR_LOCKCLR(value)            (FLEX_TWI_CR_LOCKCLR_Msk & ((value) << FLEX_TWI_CR_LOCKCLR_Pos))
#define FLEX_TWI_CR_FIFOEN_Pos                _U_(28)                                              /**< (FLEX_TWI_CR) FIFO Enable Position */
#define FLEX_TWI_CR_FIFOEN_Msk                (_U_(0x1) << FLEX_TWI_CR_FIFOEN_Pos)                 /**< (FLEX_TWI_CR) FIFO Enable Mask */
#define FLEX_TWI_CR_FIFOEN(value)             (FLEX_TWI_CR_FIFOEN_Msk & ((value) << FLEX_TWI_CR_FIFOEN_Pos))
#define FLEX_TWI_CR_FIFODIS_Pos               _U_(29)                                              /**< (FLEX_TWI_CR) FIFO Disable Position */
#define FLEX_TWI_CR_FIFODIS_Msk               (_U_(0x1) << FLEX_TWI_CR_FIFODIS_Pos)                /**< (FLEX_TWI_CR) FIFO Disable Mask */
#define FLEX_TWI_CR_FIFODIS(value)            (FLEX_TWI_CR_FIFODIS_Msk & ((value) << FLEX_TWI_CR_FIFODIS_Pos))
#define FLEX_TWI_CR_Msk                       _U_(0x3503FFFF)                                      /**< (FLEX_TWI_CR) Register Mask  */

/* FIFO_ENABLED mode */
#define FLEX_TWI_CR_FIFO_ENABLED_START_Pos    _U_(0)                                               /**< (FLEX_TWI_CR) Send a START Condition Position */
#define FLEX_TWI_CR_FIFO_ENABLED_START_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_START_Pos)     /**< (FLEX_TWI_CR) Send a START Condition Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_START(value) (FLEX_TWI_CR_FIFO_ENABLED_START_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_START_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_STOP_Pos     _U_(1)                                               /**< (FLEX_TWI_CR) Send a STOP Condition Position */
#define FLEX_TWI_CR_FIFO_ENABLED_STOP_Msk     (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_STOP_Pos)      /**< (FLEX_TWI_CR) Send a STOP Condition Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_STOP(value)  (FLEX_TWI_CR_FIFO_ENABLED_STOP_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_STOP_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_MSEN_Pos     _U_(2)                                               /**< (FLEX_TWI_CR) TWI Master Mode Enabled Position */
#define FLEX_TWI_CR_FIFO_ENABLED_MSEN_Msk     (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_MSEN_Pos)      /**< (FLEX_TWI_CR) TWI Master Mode Enabled Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_MSEN(value)  (FLEX_TWI_CR_FIFO_ENABLED_MSEN_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_MSEN_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_MSDIS_Pos    _U_(3)                                               /**< (FLEX_TWI_CR) TWI Master Mode Disabled Position */
#define FLEX_TWI_CR_FIFO_ENABLED_MSDIS_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_MSDIS_Pos)     /**< (FLEX_TWI_CR) TWI Master Mode Disabled Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_MSDIS(value) (FLEX_TWI_CR_FIFO_ENABLED_MSDIS_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_MSDIS_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_SVEN_Pos     _U_(4)                                               /**< (FLEX_TWI_CR) TWI Slave Mode Enabled Position */
#define FLEX_TWI_CR_FIFO_ENABLED_SVEN_Msk     (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_SVEN_Pos)      /**< (FLEX_TWI_CR) TWI Slave Mode Enabled Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_SVEN(value)  (FLEX_TWI_CR_FIFO_ENABLED_SVEN_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_SVEN_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_SVDIS_Pos    _U_(5)                                               /**< (FLEX_TWI_CR) TWI Slave Mode Disabled Position */
#define FLEX_TWI_CR_FIFO_ENABLED_SVDIS_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_SVDIS_Pos)     /**< (FLEX_TWI_CR) TWI Slave Mode Disabled Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_SVDIS(value) (FLEX_TWI_CR_FIFO_ENABLED_SVDIS_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_SVDIS_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_QUICK_Pos    _U_(6)                                               /**< (FLEX_TWI_CR) SMBus Quick Command Position */
#define FLEX_TWI_CR_FIFO_ENABLED_QUICK_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_QUICK_Pos)     /**< (FLEX_TWI_CR) SMBus Quick Command Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_QUICK(value) (FLEX_TWI_CR_FIFO_ENABLED_QUICK_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_QUICK_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_SWRST_Pos    _U_(7)                                               /**< (FLEX_TWI_CR) Software Reset Position */
#define FLEX_TWI_CR_FIFO_ENABLED_SWRST_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_SWRST_Pos)     /**< (FLEX_TWI_CR) Software Reset Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_SWRST(value) (FLEX_TWI_CR_FIFO_ENABLED_SWRST_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_SWRST_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_HSEN_Pos     _U_(8)                                               /**< (FLEX_TWI_CR) TWI High-Speed Mode Enabled Position */
#define FLEX_TWI_CR_FIFO_ENABLED_HSEN_Msk     (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_HSEN_Pos)      /**< (FLEX_TWI_CR) TWI High-Speed Mode Enabled Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_HSEN(value)  (FLEX_TWI_CR_FIFO_ENABLED_HSEN_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_HSEN_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_HSDIS_Pos    _U_(9)                                               /**< (FLEX_TWI_CR) TWI High-Speed Mode Disabled Position */
#define FLEX_TWI_CR_FIFO_ENABLED_HSDIS_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_HSDIS_Pos)     /**< (FLEX_TWI_CR) TWI High-Speed Mode Disabled Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_HSDIS(value) (FLEX_TWI_CR_FIFO_ENABLED_HSDIS_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_HSDIS_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_SMBEN_Pos    _U_(10)                                              /**< (FLEX_TWI_CR) SMBus Mode Enabled Position */
#define FLEX_TWI_CR_FIFO_ENABLED_SMBEN_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_SMBEN_Pos)     /**< (FLEX_TWI_CR) SMBus Mode Enabled Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_SMBEN(value) (FLEX_TWI_CR_FIFO_ENABLED_SMBEN_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_SMBEN_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_SMBDIS_Pos   _U_(11)                                              /**< (FLEX_TWI_CR) SMBus Mode Disabled Position */
#define FLEX_TWI_CR_FIFO_ENABLED_SMBDIS_Msk   (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_SMBDIS_Pos)    /**< (FLEX_TWI_CR) SMBus Mode Disabled Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_SMBDIS(value) (FLEX_TWI_CR_FIFO_ENABLED_SMBDIS_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_SMBDIS_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_PECEN_Pos    _U_(12)                                              /**< (FLEX_TWI_CR) Packet Error Checking Enable Position */
#define FLEX_TWI_CR_FIFO_ENABLED_PECEN_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_PECEN_Pos)     /**< (FLEX_TWI_CR) Packet Error Checking Enable Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_PECEN(value) (FLEX_TWI_CR_FIFO_ENABLED_PECEN_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_PECEN_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_PECDIS_Pos   _U_(13)                                              /**< (FLEX_TWI_CR) Packet Error Checking Disable Position */
#define FLEX_TWI_CR_FIFO_ENABLED_PECDIS_Msk   (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_PECDIS_Pos)    /**< (FLEX_TWI_CR) Packet Error Checking Disable Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_PECDIS(value) (FLEX_TWI_CR_FIFO_ENABLED_PECDIS_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_PECDIS_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_PECRQ_Pos    _U_(14)                                              /**< (FLEX_TWI_CR) PEC Request Position */
#define FLEX_TWI_CR_FIFO_ENABLED_PECRQ_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_PECRQ_Pos)     /**< (FLEX_TWI_CR) PEC Request Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_PECRQ(value) (FLEX_TWI_CR_FIFO_ENABLED_PECRQ_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_PECRQ_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_CLEAR_Pos    _U_(15)                                              /**< (FLEX_TWI_CR) Bus CLEAR Command Position */
#define FLEX_TWI_CR_FIFO_ENABLED_CLEAR_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_CLEAR_Pos)     /**< (FLEX_TWI_CR) Bus CLEAR Command Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_CLEAR(value) (FLEX_TWI_CR_FIFO_ENABLED_CLEAR_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_CLEAR_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_ACMEN_Pos    _U_(16)                                              /**< (FLEX_TWI_CR) Alternative Command Mode Enable Position */
#define FLEX_TWI_CR_FIFO_ENABLED_ACMEN_Msk    (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_ACMEN_Pos)     /**< (FLEX_TWI_CR) Alternative Command Mode Enable Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_ACMEN(value) (FLEX_TWI_CR_FIFO_ENABLED_ACMEN_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_ACMEN_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_ACMDIS_Pos   _U_(17)                                              /**< (FLEX_TWI_CR) Alternative Command Mode Disable Position */
#define FLEX_TWI_CR_FIFO_ENABLED_ACMDIS_Msk   (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_ACMDIS_Pos)    /**< (FLEX_TWI_CR) Alternative Command Mode Disable Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_ACMDIS(value) (FLEX_TWI_CR_FIFO_ENABLED_ACMDIS_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_ACMDIS_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_TXFCLR_Pos   _U_(24)                                              /**< (FLEX_TWI_CR) Transmit FIFO Clear Position */
#define FLEX_TWI_CR_FIFO_ENABLED_TXFCLR_Msk   (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_TXFCLR_Pos)    /**< (FLEX_TWI_CR) Transmit FIFO Clear Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_TXFCLR(value) (FLEX_TWI_CR_FIFO_ENABLED_TXFCLR_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_TXFCLR_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_RXFCLR_Pos   _U_(25)                                              /**< (FLEX_TWI_CR) Receive FIFO Clear Position */
#define FLEX_TWI_CR_FIFO_ENABLED_RXFCLR_Msk   (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_RXFCLR_Pos)    /**< (FLEX_TWI_CR) Receive FIFO Clear Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_RXFCLR(value) (FLEX_TWI_CR_FIFO_ENABLED_RXFCLR_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_RXFCLR_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_TXFLCLR_Pos  _U_(26)                                              /**< (FLEX_TWI_CR) Transmit FIFO Lock CLEAR Position */
#define FLEX_TWI_CR_FIFO_ENABLED_TXFLCLR_Msk  (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_TXFLCLR_Pos)   /**< (FLEX_TWI_CR) Transmit FIFO Lock CLEAR Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_TXFLCLR(value) (FLEX_TWI_CR_FIFO_ENABLED_TXFLCLR_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_TXFLCLR_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_FIFOEN_Pos   _U_(28)                                              /**< (FLEX_TWI_CR) FIFO Enable Position */
#define FLEX_TWI_CR_FIFO_ENABLED_FIFOEN_Msk   (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_FIFOEN_Pos)    /**< (FLEX_TWI_CR) FIFO Enable Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_FIFOEN(value) (FLEX_TWI_CR_FIFO_ENABLED_FIFOEN_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_FIFOEN_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_FIFODIS_Pos  _U_(29)                                              /**< (FLEX_TWI_CR) FIFO Disable Position */
#define FLEX_TWI_CR_FIFO_ENABLED_FIFODIS_Msk  (_U_(0x1) << FLEX_TWI_CR_FIFO_ENABLED_FIFODIS_Pos)   /**< (FLEX_TWI_CR) FIFO Disable Mask */
#define FLEX_TWI_CR_FIFO_ENABLED_FIFODIS(value) (FLEX_TWI_CR_FIFO_ENABLED_FIFODIS_Msk & ((value) << FLEX_TWI_CR_FIFO_ENABLED_FIFODIS_Pos))
#define FLEX_TWI_CR_FIFO_ENABLED_Msk          _U_(0x3703FFFF)                                       /**< (FLEX_TWI_CR_FIFO_ENABLED) Register Mask  */


