Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/flexcom.h
/* -------- FLEX_TWI_MMR : (FLEXCOM Offset: 0x604) (R/W 32) TWI Master Mode Register -------- */
#define FLEX_TWI_MMR_IADRSZ_Pos               _U_(8)                                               /**< (FLEX_TWI_MMR) Internal Device Address Size Position */
#define FLEX_TWI_MMR_IADRSZ_Msk               (_U_(0x3) << FLEX_TWI_MMR_IADRSZ_Pos)                /**< (FLEX_TWI_MMR) Internal Device Address Size Mask */
#define FLEX_TWI_MMR_IADRSZ(value)            (FLEX_TWI_MMR_IADRSZ_Msk & ((value) << FLEX_TWI_MMR_IADRSZ_Pos))
#define   FLEX_TWI_MMR_IADRSZ_NONE_Val        _U_(0x0)                                             /**< (FLEX_TWI_MMR) No internal device address  */
#define   FLEX_TWI_MMR_IADRSZ_1_BYTE_Val      _U_(0x1)                                             /**< (FLEX_TWI_MMR) One-byte internal device address  */
#define   FLEX_TWI_MMR_IADRSZ_2_BYTE_Val      _U_(0x2)                                             /**< (FLEX_TWI_MMR) Two-byte internal device address  */
#define   FLEX_TWI_MMR_IADRSZ_3_BYTE_Val      _U_(0x3)                                             /**< (FLEX_TWI_MMR) Three-byte internal device address  */
#define FLEX_TWI_MMR_IADRSZ_NONE              (FLEX_TWI_MMR_IADRSZ_NONE_Val << FLEX_TWI_MMR_IADRSZ_Pos) /**< (FLEX_TWI_MMR) No internal device address Position  */
#define FLEX_TWI_MMR_IADRSZ_1_BYTE            (FLEX_TWI_MMR_IADRSZ_1_BYTE_Val << FLEX_TWI_MMR_IADRSZ_Pos) /**< (FLEX_TWI_MMR) One-byte internal device address Position  */
#define FLEX_TWI_MMR_IADRSZ_2_BYTE            (FLEX_TWI_MMR_IADRSZ_2_BYTE_Val << FLEX_TWI_MMR_IADRSZ_Pos) /**< (FLEX_TWI_MMR) Two-byte internal device address Position  */
#define FLEX_TWI_MMR_IADRSZ_3_BYTE            (FLEX_TWI_MMR_IADRSZ_3_BYTE_Val << FLEX_TWI_MMR_IADRSZ_Pos) /**< (FLEX_TWI_MMR) Three-byte internal device address Position  */
#define FLEX_TWI_MMR_MREAD_Pos                _U_(12)                                              /**< (FLEX_TWI_MMR) Master Read Direction Position */
#define FLEX_TWI_MMR_MREAD_Msk                (_U_(0x1) << FLEX_TWI_MMR_MREAD_Pos)                 /**< (FLEX_TWI_MMR) Master Read Direction Mask */
#define FLEX_TWI_MMR_MREAD(value)             (FLEX_TWI_MMR_MREAD_Msk & ((value) << FLEX_TWI_MMR_MREAD_Pos))
#define FLEX_TWI_MMR_DADR_Pos                 _U_(16)                                              /**< (FLEX_TWI_MMR) Device Address Position */
#define FLEX_TWI_MMR_DADR_Msk                 (_U_(0x7F) << FLEX_TWI_MMR_DADR_Pos)                 /**< (FLEX_TWI_MMR) Device Address Mask */
#define FLEX_TWI_MMR_DADR(value)              (FLEX_TWI_MMR_DADR_Msk & ((value) << FLEX_TWI_MMR_DADR_Pos))
#define FLEX_TWI_MMR_NOAP_Pos                 _U_(24)                                              /**< (FLEX_TWI_MMR) No Auto-Stop On NACK Error Position */
#define FLEX_TWI_MMR_NOAP_Msk                 (_U_(0x1) << FLEX_TWI_MMR_NOAP_Pos)                  /**< (FLEX_TWI_MMR) No Auto-Stop On NACK Error Mask */
#define FLEX_TWI_MMR_NOAP(value)              (FLEX_TWI_MMR_NOAP_Msk & ((value) << FLEX_TWI_MMR_NOAP_Pos))
#define FLEX_TWI_MMR_Msk                      _U_(0x017F1300)                                      /**< (FLEX_TWI_MMR) Register Mask  */


/* -------- FLEX_TWI_SMR : (FLEXCOM Offset: 0x608) (R/W 32) TWI Slave Mode Register -------- */
#define FLEX_TWI_SMR_NACKEN_Pos               _U_(0)                                               /**< (FLEX_TWI_SMR) Slave Receiver Data Phase NACK Enable Position */
#define FLEX_TWI_SMR_NACKEN_Msk               (_U_(0x1) << FLEX_TWI_SMR_NACKEN_Pos)                /**< (FLEX_TWI_SMR) Slave Receiver Data Phase NACK Enable Mask */
#define FLEX_TWI_SMR_NACKEN(value)            (FLEX_TWI_SMR_NACKEN_Msk & ((value) << FLEX_TWI_SMR_NACKEN_Pos))
#define FLEX_TWI_SMR_SMDA_Pos                 _U_(2)                                               /**< (FLEX_TWI_SMR) SMBus Default Address Position */
#define FLEX_TWI_SMR_SMDA_Msk                 (_U_(0x1) << FLEX_TWI_SMR_SMDA_Pos)                  /**< (FLEX_TWI_SMR) SMBus Default Address Mask */
#define FLEX_TWI_SMR_SMDA(value)              (FLEX_TWI_SMR_SMDA_Msk & ((value) << FLEX_TWI_SMR_SMDA_Pos))
#define FLEX_TWI_SMR_SMHH_Pos                 _U_(3)                                               /**< (FLEX_TWI_SMR) SMBus Host Header Position */
#define FLEX_TWI_SMR_SMHH_Msk                 (_U_(0x1) << FLEX_TWI_SMR_SMHH_Pos)                  /**< (FLEX_TWI_SMR) SMBus Host Header Mask */
#define FLEX_TWI_SMR_SMHH(value)              (FLEX_TWI_SMR_SMHH_Msk & ((value) << FLEX_TWI_SMR_SMHH_Pos))
#define FLEX_TWI_SMR_SADAT_Pos                _U_(4)                                               /**< (FLEX_TWI_SMR) Slave Address Treated as Data Position */
#define FLEX_TWI_SMR_SADAT_Msk                (_U_(0x1) << FLEX_TWI_SMR_SADAT_Pos)                 /**< (FLEX_TWI_SMR) Slave Address Treated as Data Mask */
#define FLEX_TWI_SMR_SADAT(value)             (FLEX_TWI_SMR_SADAT_Msk & ((value) << FLEX_TWI_SMR_SADAT_Pos))
#define FLEX_TWI_SMR_SCLWSDIS_Pos             _U_(6)                                               /**< (FLEX_TWI_SMR) Clock Wait State Disable Position */
#define FLEX_TWI_SMR_SCLWSDIS_Msk             (_U_(0x1) << FLEX_TWI_SMR_SCLWSDIS_Pos)              /**< (FLEX_TWI_SMR) Clock Wait State Disable Mask */
#define FLEX_TWI_SMR_SCLWSDIS(value)          (FLEX_TWI_SMR_SCLWSDIS_Msk & ((value) << FLEX_TWI_SMR_SCLWSDIS_Pos))
#define FLEX_TWI_SMR_SNIFF_Pos                _U_(7)                                               /**< (FLEX_TWI_SMR) Slave Sniffer Mode Position */
#define FLEX_TWI_SMR_SNIFF_Msk                (_U_(0x1) << FLEX_TWI_SMR_SNIFF_Pos)                 /**< (FLEX_TWI_SMR) Slave Sniffer Mode Mask */
#define FLEX_TWI_SMR_SNIFF(value)             (FLEX_TWI_SMR_SNIFF_Msk & ((value) << FLEX_TWI_SMR_SNIFF_Pos))
#define FLEX_TWI_SMR_MASK_Pos                 _U_(8)                                               /**< (FLEX_TWI_SMR) Slave Address Mask Position */
#define FLEX_TWI_SMR_MASK_Msk                 (_U_(0x7F) << FLEX_TWI_SMR_MASK_Pos)                 /**< (FLEX_TWI_SMR) Slave Address Mask Mask */
#define FLEX_TWI_SMR_MASK(value)              (FLEX_TWI_SMR_MASK_Msk & ((value) << FLEX_TWI_SMR_MASK_Pos))
#define FLEX_TWI_SMR_SADR_Pos                 _U_(16)                                              /**< (FLEX_TWI_SMR) Slave Address Position */
#define FLEX_TWI_SMR_SADR_Msk                 (_U_(0x7F) << FLEX_TWI_SMR_SADR_Pos)                 /**< (FLEX_TWI_SMR) Slave Address Mask */
#define FLEX_TWI_SMR_SADR(value)              (FLEX_TWI_SMR_SADR_Msk & ((value) << FLEX_TWI_SMR_SADR_Pos))
#define FLEX_TWI_SMR_Msk                      _U_(0x007F7FDD)                                      /**< (FLEX_TWI_SMR) Register Mask  */


/* -------- FLEX_TWI_IADR : (FLEXCOM Offset: 0x60C) (R/W 32) TWI Internal Address Register -------- */
#define FLEX_TWI_IADR_IADR_Pos                _U_(0)                                               /**< (FLEX_TWI_IADR) Internal Address Position */
#define FLEX_TWI_IADR_IADR_Msk                (_U_(0xFFFFFF) << FLEX_TWI_IADR_IADR_Pos)            /**< (FLEX_TWI_IADR) Internal Address Mask */
#define FLEX_TWI_IADR_IADR(value)             (FLEX_TWI_IADR_IADR_Msk & ((value) << FLEX_TWI_IADR_IADR_Pos))
#define FLEX_TWI_IADR_Msk                     _U_(0x00FFFFFF)                                      /**< (FLEX_TWI_IADR) Register Mask  */


/* -------- FLEX_TWI_CWGR : (FLEXCOM Offset: 0x610) (R/W 32) TWI Clock Waveform Generator Register -------- */
#define FLEX_TWI_CWGR_CLDIV_Pos               _U_(0)                                               /**< (FLEX_TWI_CWGR) Clock Low Divider Position */
#define FLEX_TWI_CWGR_CLDIV_Msk               (_U_(0xFF) << FLEX_TWI_CWGR_CLDIV_Pos)               /**< (FLEX_TWI_CWGR) Clock Low Divider Mask */
#define FLEX_TWI_CWGR_CLDIV(value)            (FLEX_TWI_CWGR_CLDIV_Msk & ((value) << FLEX_TWI_CWGR_CLDIV_Pos))
#define FLEX_TWI_CWGR_CHDIV_Pos               _U_(8)                                               /**< (FLEX_TWI_CWGR) Clock High Divider Position */
#define FLEX_TWI_CWGR_CHDIV_Msk               (_U_(0xFF) << FLEX_TWI_CWGR_CHDIV_Pos)               /**< (FLEX_TWI_CWGR) Clock High Divider Mask */
#define FLEX_TWI_CWGR_CHDIV(value)            (FLEX_TWI_CWGR_CHDIV_Msk & ((value) << FLEX_TWI_CWGR_CHDIV_Pos))
#define FLEX_TWI_CWGR_CKDIV_Pos               _U_(16)                                              /**< (FLEX_TWI_CWGR) Clock Divider Position */
#define FLEX_TWI_CWGR_CKDIV_Msk               (_U_(0x7) << FLEX_TWI_CWGR_CKDIV_Pos)                /**< (FLEX_TWI_CWGR) Clock Divider Mask */
#define FLEX_TWI_CWGR_CKDIV(value)            (FLEX_TWI_CWGR_CKDIV_Msk & ((value) << FLEX_TWI_CWGR_CKDIV_Pos))
#define FLEX_TWI_CWGR_BRSRCCLK_Pos            _U_(20)                                              /**< (FLEX_TWI_CWGR) Bit Rate Source Clock Position */
#define FLEX_TWI_CWGR_BRSRCCLK_Msk            (_U_(0x1) << FLEX_TWI_CWGR_BRSRCCLK_Pos)             /**< (FLEX_TWI_CWGR) Bit Rate Source Clock Mask */
#define FLEX_TWI_CWGR_BRSRCCLK(value)         (FLEX_TWI_CWGR_BRSRCCLK_Msk & ((value) << FLEX_TWI_CWGR_BRSRCCLK_Pos))
#define   FLEX_TWI_CWGR_BRSRCCLK_PERIPH_CLK_Val _U_(0x0)                                             /**< (FLEX_TWI_CWGR) The peripheral clock is the source clock for the bit rate generation.  */
#define   FLEX_TWI_CWGR_BRSRCCLK_GCLK_Val     _U_(0x1)                                             /**< (FLEX_TWI_CWGR) GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock.  */
#define FLEX_TWI_CWGR_BRSRCCLK_PERIPH_CLK     (FLEX_TWI_CWGR_BRSRCCLK_PERIPH_CLK_Val << FLEX_TWI_CWGR_BRSRCCLK_Pos) /**< (FLEX_TWI_CWGR) The peripheral clock is the source clock for the bit rate generation. Position  */
#define FLEX_TWI_CWGR_BRSRCCLK_GCLK           (FLEX_TWI_CWGR_BRSRCCLK_GCLK_Val << FLEX_TWI_CWGR_BRSRCCLK_Pos) /**< (FLEX_TWI_CWGR) GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock. Position  */
#define FLEX_TWI_CWGR_HOLD_Pos                _U_(24)                                              /**< (FLEX_TWI_CWGR) TWD Hold Time Versus TWCK Falling Position */
#define FLEX_TWI_CWGR_HOLD_Msk                (_U_(0x3F) << FLEX_TWI_CWGR_HOLD_Pos)                /**< (FLEX_TWI_CWGR) TWD Hold Time Versus TWCK Falling Mask */
#define FLEX_TWI_CWGR_HOLD(value)             (FLEX_TWI_CWGR_HOLD_Msk & ((value) << FLEX_TWI_CWGR_HOLD_Pos))
#define FLEX_TWI_CWGR_Msk                     _U_(0x3F17FFFF)                                      /**< (FLEX_TWI_CWGR) Register Mask  */


/* -------- FLEX_TWI_SR : (FLEXCOM Offset: 0x620) ( R/ 32) TWI Status Register -------- */
#define FLEX_TWI_SR_TXCOMP_Pos                _U_(0)                                               /**< (FLEX_TWI_SR) Transmission Completed (cleared by writing FLEX_TWI_THR) Position */
#define FLEX_TWI_SR_TXCOMP_Msk                (_U_(0x1) << FLEX_TWI_SR_TXCOMP_Pos)                 /**< (FLEX_TWI_SR) Transmission Completed (cleared by writing FLEX_TWI_THR) Mask */
#define FLEX_TWI_SR_TXCOMP(value)             (FLEX_TWI_SR_TXCOMP_Msk & ((value) << FLEX_TWI_SR_TXCOMP_Pos))
#define FLEX_TWI_SR_RXRDY_Pos                 _U_(1)                                               /**< (FLEX_TWI_SR) Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR) Position */
#define FLEX_TWI_SR_RXRDY_Msk                 (_U_(0x1) << FLEX_TWI_SR_RXRDY_Pos)                  /**< (FLEX_TWI_SR) Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR) Mask */
#define FLEX_TWI_SR_RXRDY(value)              (FLEX_TWI_SR_RXRDY_Msk & ((value) << FLEX_TWI_SR_RXRDY_Pos))
#define FLEX_TWI_SR_TXRDY_Pos                 _U_(2)                                               /**< (FLEX_TWI_SR) Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR) Position */
#define FLEX_TWI_SR_TXRDY_Msk                 (_U_(0x1) << FLEX_TWI_SR_TXRDY_Pos)                  /**< (FLEX_TWI_SR) Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR) Mask */
#define FLEX_TWI_SR_TXRDY(value)              (FLEX_TWI_SR_TXRDY_Msk & ((value) << FLEX_TWI_SR_TXRDY_Pos))
#define FLEX_TWI_SR_SVREAD_Pos                _U_(3)                                               /**< (FLEX_TWI_SR) Slave Read Position */
#define FLEX_TWI_SR_SVREAD_Msk                (_U_(0x1) << FLEX_TWI_SR_SVREAD_Pos)                 /**< (FLEX_TWI_SR) Slave Read Mask */
#define FLEX_TWI_SR_SVREAD(value)             (FLEX_TWI_SR_SVREAD_Msk & ((value) << FLEX_TWI_SR_SVREAD_Pos))
#define FLEX_TWI_SR_SVACC_Pos                 _U_(4)                                               /**< (FLEX_TWI_SR) Slave Access Position */
#define FLEX_TWI_SR_SVACC_Msk                 (_U_(0x1) << FLEX_TWI_SR_SVACC_Pos)                  /**< (FLEX_TWI_SR) Slave Access Mask */
#define FLEX_TWI_SR_SVACC(value)              (FLEX_TWI_SR_SVACC_Msk & ((value) << FLEX_TWI_SR_SVACC_Pos))
#define FLEX_TWI_SR_GACC_Pos                  _U_(5)                                               /**< (FLEX_TWI_SR) General Call Access (cleared on read) Position */
#define FLEX_TWI_SR_GACC_Msk                  (_U_(0x1) << FLEX_TWI_SR_GACC_Pos)                   /**< (FLEX_TWI_SR) General Call Access (cleared on read) Mask */
#define FLEX_TWI_SR_GACC(value)               (FLEX_TWI_SR_GACC_Msk & ((value) << FLEX_TWI_SR_GACC_Pos))
#define FLEX_TWI_SR_OVRE_Pos                  _U_(6)                                               /**< (FLEX_TWI_SR) Overrun Error (cleared on read) Position */
#define FLEX_TWI_SR_OVRE_Msk                  (_U_(0x1) << FLEX_TWI_SR_OVRE_Pos)                   /**< (FLEX_TWI_SR) Overrun Error (cleared on read) Mask */
#define FLEX_TWI_SR_OVRE(value)               (FLEX_TWI_SR_OVRE_Msk & ((value) << FLEX_TWI_SR_OVRE_Pos))
#define FLEX_TWI_SR_UNRE_Pos                  _U_(7)                                               /**< (FLEX_TWI_SR) Underrun Error (cleared on read) Position */
#define FLEX_TWI_SR_UNRE_Msk                  (_U_(0x1) << FLEX_TWI_SR_UNRE_Pos)                   /**< (FLEX_TWI_SR) Underrun Error (cleared on read) Mask */
#define FLEX_TWI_SR_UNRE(value)               (FLEX_TWI_SR_UNRE_Msk & ((value) << FLEX_TWI_SR_UNRE_Pos))
#define FLEX_TWI_SR_NACK_Pos                  _U_(8)                                               /**< (FLEX_TWI_SR) Not Acknowledged (cleared on read) Position */
#define FLEX_TWI_SR_NACK_Msk                  (_U_(0x1) << FLEX_TWI_SR_NACK_Pos)                   /**< (FLEX_TWI_SR) Not Acknowledged (cleared on read) Mask */
#define FLEX_TWI_SR_NACK(value)               (FLEX_TWI_SR_NACK_Msk & ((value) << FLEX_TWI_SR_NACK_Pos))
#define FLEX_TWI_SR_ARBLST_Pos                _U_(9)                                               /**< (FLEX_TWI_SR) Arbitration Lost (cleared on read) Position */
#define FLEX_TWI_SR_ARBLST_Msk                (_U_(0x1) << FLEX_TWI_SR_ARBLST_Pos)                 /**< (FLEX_TWI_SR) Arbitration Lost (cleared on read) Mask */
#define FLEX_TWI_SR_ARBLST(value)             (FLEX_TWI_SR_ARBLST_Msk & ((value) << FLEX_TWI_SR_ARBLST_Pos))
#define FLEX_TWI_SR_SCLWS_Pos                 _U_(10)                                              /**< (FLEX_TWI_SR) Clock Wait State Position */
#define FLEX_TWI_SR_SCLWS_Msk                 (_U_(0x1) << FLEX_TWI_SR_SCLWS_Pos)                  /**< (FLEX_TWI_SR) Clock Wait State Mask */
#define FLEX_TWI_SR_SCLWS(value)              (FLEX_TWI_SR_SCLWS_Msk & ((value) << FLEX_TWI_SR_SCLWS_Pos))
#define FLEX_TWI_SR_EOSACC_Pos                _U_(11)                                              /**< (FLEX_TWI_SR) End Of Slave Access (cleared on read) Position */
#define FLEX_TWI_SR_EOSACC_Msk                (_U_(0x1) << FLEX_TWI_SR_EOSACC_Pos)                 /**< (FLEX_TWI_SR) End Of Slave Access (cleared on read) Mask */
#define FLEX_TWI_SR_EOSACC(value)             (FLEX_TWI_SR_EOSACC_Msk & ((value) << FLEX_TWI_SR_EOSACC_Pos))
#define FLEX_TWI_SR_MCACK_Pos                 _U_(16)                                              /**< (FLEX_TWI_SR) Master Code Acknowledge (cleared on read) Position */
#define FLEX_TWI_SR_MCACK_Msk                 (_U_(0x1) << FLEX_TWI_SR_MCACK_Pos)                  /**< (FLEX_TWI_SR) Master Code Acknowledge (cleared on read) Mask */
#define FLEX_TWI_SR_MCACK(value)              (FLEX_TWI_SR_MCACK_Msk & ((value) << FLEX_TWI_SR_MCACK_Pos))
#define FLEX_TWI_SR_TOUT_Pos                  _U_(18)                                              /**< (FLEX_TWI_SR) Timeout Error (cleared on read) Position */
#define FLEX_TWI_SR_TOUT_Msk                  (_U_(0x1) << FLEX_TWI_SR_TOUT_Pos)                   /**< (FLEX_TWI_SR) Timeout Error (cleared on read) Mask */
#define FLEX_TWI_SR_TOUT(value)               (FLEX_TWI_SR_TOUT_Msk & ((value) << FLEX_TWI_SR_TOUT_Pos))
#define FLEX_TWI_SR_PECERR_Pos                _U_(19)                                              /**< (FLEX_TWI_SR) PEC Error (cleared on read) Position */
#define FLEX_TWI_SR_PECERR_Msk                (_U_(0x1) << FLEX_TWI_SR_PECERR_Pos)                 /**< (FLEX_TWI_SR) PEC Error (cleared on read) Mask */
#define FLEX_TWI_SR_PECERR(value)             (FLEX_TWI_SR_PECERR_Msk & ((value) << FLEX_TWI_SR_PECERR_Pos))
#define FLEX_TWI_SR_SMBDAM_Pos                _U_(20)                                              /**< (FLEX_TWI_SR) SMBus Default Address Match (cleared on read) Position */
#define FLEX_TWI_SR_SMBDAM_Msk                (_U_(0x1) << FLEX_TWI_SR_SMBDAM_Pos)                 /**< (FLEX_TWI_SR) SMBus Default Address Match (cleared on read) Mask */
#define FLEX_TWI_SR_SMBDAM(value)             (FLEX_TWI_SR_SMBDAM_Msk & ((value) << FLEX_TWI_SR_SMBDAM_Pos))
#define FLEX_TWI_SR_SMBHHM_Pos                _U_(21)                                              /**< (FLEX_TWI_SR) SMBus Host Header Address Match (cleared on read) Position */
#define FLEX_TWI_SR_SMBHHM_Msk                (_U_(0x1) << FLEX_TWI_SR_SMBHHM_Pos)                 /**< (FLEX_TWI_SR) SMBus Host Header Address Match (cleared on read) Mask */
#define FLEX_TWI_SR_SMBHHM(value)             (FLEX_TWI_SR_SMBHHM_Msk & ((value) << FLEX_TWI_SR_SMBHHM_Pos))
#define FLEX_TWI_SR_LOCK_Pos                  _U_(23)                                              /**< (FLEX_TWI_SR) TWI Lock Due to Frame Errors Position */
#define FLEX_TWI_SR_LOCK_Msk                  (_U_(0x1) << FLEX_TWI_SR_LOCK_Pos)                   /**< (FLEX_TWI_SR) TWI Lock Due to Frame Errors Mask */
#define FLEX_TWI_SR_LOCK(value)               (FLEX_TWI_SR_LOCK_Msk & ((value) << FLEX_TWI_SR_LOCK_Pos))
#define FLEX_TWI_SR_SCL_Pos                   _U_(24)                                              /**< (FLEX_TWI_SR) SCL Line Value Position */
#define FLEX_TWI_SR_SCL_Msk                   (_U_(0x1) << FLEX_TWI_SR_SCL_Pos)                    /**< (FLEX_TWI_SR) SCL Line Value Mask */
#define FLEX_TWI_SR_SCL(value)                (FLEX_TWI_SR_SCL_Msk & ((value) << FLEX_TWI_SR_SCL_Pos))
#define FLEX_TWI_SR_SDA_Pos                   _U_(25)                                              /**< (FLEX_TWI_SR) SDA Line Value Position */
#define FLEX_TWI_SR_SDA_Msk                   (_U_(0x1) << FLEX_TWI_SR_SDA_Pos)                    /**< (FLEX_TWI_SR) SDA Line Value Mask */
#define FLEX_TWI_SR_SDA(value)                (FLEX_TWI_SR_SDA_Msk & ((value) << FLEX_TWI_SR_SDA_Pos))
#define FLEX_TWI_SR_Msk                       _U_(0x03BD0FFF)                                      /**< (FLEX_TWI_SR) Register Mask  */

