Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/flexcom.h
/* -------- FLEX_TWI_IDR : (FLEXCOM Offset: 0x628) ( /W 32) TWI Interrupt Disable Register -------- */
#define FLEX_TWI_IDR_TXCOMP_Pos               _U_(0)                                               /**< (FLEX_TWI_IDR) Transmission Completed Interrupt Disable Position */
#define FLEX_TWI_IDR_TXCOMP_Msk               (_U_(0x1) << FLEX_TWI_IDR_TXCOMP_Pos)                /**< (FLEX_TWI_IDR) Transmission Completed Interrupt Disable Mask */
#define FLEX_TWI_IDR_TXCOMP(value)            (FLEX_TWI_IDR_TXCOMP_Msk & ((value) << FLEX_TWI_IDR_TXCOMP_Pos))
#define FLEX_TWI_IDR_RXRDY_Pos                _U_(1)                                               /**< (FLEX_TWI_IDR) Receive Holding Register Ready Interrupt Disable Position */
#define FLEX_TWI_IDR_RXRDY_Msk                (_U_(0x1) << FLEX_TWI_IDR_RXRDY_Pos)                 /**< (FLEX_TWI_IDR) Receive Holding Register Ready Interrupt Disable Mask */
#define FLEX_TWI_IDR_RXRDY(value)             (FLEX_TWI_IDR_RXRDY_Msk & ((value) << FLEX_TWI_IDR_RXRDY_Pos))
#define FLEX_TWI_IDR_TXRDY_Pos                _U_(2)                                               /**< (FLEX_TWI_IDR) Transmit Holding Register Ready Interrupt Disable Position */
#define FLEX_TWI_IDR_TXRDY_Msk                (_U_(0x1) << FLEX_TWI_IDR_TXRDY_Pos)                 /**< (FLEX_TWI_IDR) Transmit Holding Register Ready Interrupt Disable Mask */
#define FLEX_TWI_IDR_TXRDY(value)             (FLEX_TWI_IDR_TXRDY_Msk & ((value) << FLEX_TWI_IDR_TXRDY_Pos))
#define FLEX_TWI_IDR_SVACC_Pos                _U_(4)                                               /**< (FLEX_TWI_IDR) Slave Access Interrupt Disable Position */
#define FLEX_TWI_IDR_SVACC_Msk                (_U_(0x1) << FLEX_TWI_IDR_SVACC_Pos)                 /**< (FLEX_TWI_IDR) Slave Access Interrupt Disable Mask */
#define FLEX_TWI_IDR_SVACC(value)             (FLEX_TWI_IDR_SVACC_Msk & ((value) << FLEX_TWI_IDR_SVACC_Pos))
#define FLEX_TWI_IDR_GACC_Pos                 _U_(5)                                               /**< (FLEX_TWI_IDR) General Call Access Interrupt Disable Position */
#define FLEX_TWI_IDR_GACC_Msk                 (_U_(0x1) << FLEX_TWI_IDR_GACC_Pos)                  /**< (FLEX_TWI_IDR) General Call Access Interrupt Disable Mask */
#define FLEX_TWI_IDR_GACC(value)              (FLEX_TWI_IDR_GACC_Msk & ((value) << FLEX_TWI_IDR_GACC_Pos))
#define FLEX_TWI_IDR_OVRE_Pos                 _U_(6)                                               /**< (FLEX_TWI_IDR) Overrun Error Interrupt Disable Position */
#define FLEX_TWI_IDR_OVRE_Msk                 (_U_(0x1) << FLEX_TWI_IDR_OVRE_Pos)                  /**< (FLEX_TWI_IDR) Overrun Error Interrupt Disable Mask */
#define FLEX_TWI_IDR_OVRE(value)              (FLEX_TWI_IDR_OVRE_Msk & ((value) << FLEX_TWI_IDR_OVRE_Pos))
#define FLEX_TWI_IDR_UNRE_Pos                 _U_(7)                                               /**< (FLEX_TWI_IDR) Underrun Error Interrupt Disable Position */
#define FLEX_TWI_IDR_UNRE_Msk                 (_U_(0x1) << FLEX_TWI_IDR_UNRE_Pos)                  /**< (FLEX_TWI_IDR) Underrun Error Interrupt Disable Mask */
#define FLEX_TWI_IDR_UNRE(value)              (FLEX_TWI_IDR_UNRE_Msk & ((value) << FLEX_TWI_IDR_UNRE_Pos))
#define FLEX_TWI_IDR_NACK_Pos                 _U_(8)                                               /**< (FLEX_TWI_IDR) Not Acknowledge Interrupt Disable Position */
#define FLEX_TWI_IDR_NACK_Msk                 (_U_(0x1) << FLEX_TWI_IDR_NACK_Pos)                  /**< (FLEX_TWI_IDR) Not Acknowledge Interrupt Disable Mask */
#define FLEX_TWI_IDR_NACK(value)              (FLEX_TWI_IDR_NACK_Msk & ((value) << FLEX_TWI_IDR_NACK_Pos))
#define FLEX_TWI_IDR_ARBLST_Pos               _U_(9)                                               /**< (FLEX_TWI_IDR) Arbitration Lost Interrupt Disable Position */
#define FLEX_TWI_IDR_ARBLST_Msk               (_U_(0x1) << FLEX_TWI_IDR_ARBLST_Pos)                /**< (FLEX_TWI_IDR) Arbitration Lost Interrupt Disable Mask */
#define FLEX_TWI_IDR_ARBLST(value)            (FLEX_TWI_IDR_ARBLST_Msk & ((value) << FLEX_TWI_IDR_ARBLST_Pos))
#define FLEX_TWI_IDR_SCL_WS_Pos               _U_(10)                                              /**< (FLEX_TWI_IDR) Clock Wait State Interrupt Disable Position */
#define FLEX_TWI_IDR_SCL_WS_Msk               (_U_(0x1) << FLEX_TWI_IDR_SCL_WS_Pos)                /**< (FLEX_TWI_IDR) Clock Wait State Interrupt Disable Mask */
#define FLEX_TWI_IDR_SCL_WS(value)            (FLEX_TWI_IDR_SCL_WS_Msk & ((value) << FLEX_TWI_IDR_SCL_WS_Pos))
#define FLEX_TWI_IDR_EOSACC_Pos               _U_(11)                                              /**< (FLEX_TWI_IDR) End Of Slave Access Interrupt Disable Position */
#define FLEX_TWI_IDR_EOSACC_Msk               (_U_(0x1) << FLEX_TWI_IDR_EOSACC_Pos)                /**< (FLEX_TWI_IDR) End Of Slave Access Interrupt Disable Mask */
#define FLEX_TWI_IDR_EOSACC(value)            (FLEX_TWI_IDR_EOSACC_Msk & ((value) << FLEX_TWI_IDR_EOSACC_Pos))
#define FLEX_TWI_IDR_ENDRX_Pos                _U_(12)                                              /**< (FLEX_TWI_IDR) End of Receive Buffer Interrupt Disable Position */
#define FLEX_TWI_IDR_ENDRX_Msk                (_U_(0x1) << FLEX_TWI_IDR_ENDRX_Pos)                 /**< (FLEX_TWI_IDR) End of Receive Buffer Interrupt Disable Mask */
#define FLEX_TWI_IDR_ENDRX(value)             (FLEX_TWI_IDR_ENDRX_Msk & ((value) << FLEX_TWI_IDR_ENDRX_Pos))
#define FLEX_TWI_IDR_ENDTX_Pos                _U_(13)                                              /**< (FLEX_TWI_IDR) End of Transmit Buffer Interrupt Disable Position */
#define FLEX_TWI_IDR_ENDTX_Msk                (_U_(0x1) << FLEX_TWI_IDR_ENDTX_Pos)                 /**< (FLEX_TWI_IDR) End of Transmit Buffer Interrupt Disable Mask */
#define FLEX_TWI_IDR_ENDTX(value)             (FLEX_TWI_IDR_ENDTX_Msk & ((value) << FLEX_TWI_IDR_ENDTX_Pos))
#define FLEX_TWI_IDR_RXBUFF_Pos               _U_(14)                                              /**< (FLEX_TWI_IDR) Receive Buffer Full Interrupt Disable Position */
#define FLEX_TWI_IDR_RXBUFF_Msk               (_U_(0x1) << FLEX_TWI_IDR_RXBUFF_Pos)                /**< (FLEX_TWI_IDR) Receive Buffer Full Interrupt Disable Mask */
#define FLEX_TWI_IDR_RXBUFF(value)            (FLEX_TWI_IDR_RXBUFF_Msk & ((value) << FLEX_TWI_IDR_RXBUFF_Pos))
#define FLEX_TWI_IDR_TXBUFE_Pos               _U_(15)                                              /**< (FLEX_TWI_IDR) Transmit Buffer Empty Interrupt Disable Position */
#define FLEX_TWI_IDR_TXBUFE_Msk               (_U_(0x1) << FLEX_TWI_IDR_TXBUFE_Pos)                /**< (FLEX_TWI_IDR) Transmit Buffer Empty Interrupt Disable Mask */
#define FLEX_TWI_IDR_TXBUFE(value)            (FLEX_TWI_IDR_TXBUFE_Msk & ((value) << FLEX_TWI_IDR_TXBUFE_Pos))
#define FLEX_TWI_IDR_MCACK_Pos                _U_(16)                                              /**< (FLEX_TWI_IDR) Master Code Acknowledge Interrupt Disable Position */
#define FLEX_TWI_IDR_MCACK_Msk                (_U_(0x1) << FLEX_TWI_IDR_MCACK_Pos)                 /**< (FLEX_TWI_IDR) Master Code Acknowledge Interrupt Disable Mask */
#define FLEX_TWI_IDR_MCACK(value)             (FLEX_TWI_IDR_MCACK_Msk & ((value) << FLEX_TWI_IDR_MCACK_Pos))
#define FLEX_TWI_IDR_TOUT_Pos                 _U_(18)                                              /**< (FLEX_TWI_IDR) Timeout Error Interrupt Disable Position */
#define FLEX_TWI_IDR_TOUT_Msk                 (_U_(0x1) << FLEX_TWI_IDR_TOUT_Pos)                  /**< (FLEX_TWI_IDR) Timeout Error Interrupt Disable Mask */
#define FLEX_TWI_IDR_TOUT(value)              (FLEX_TWI_IDR_TOUT_Msk & ((value) << FLEX_TWI_IDR_TOUT_Pos))
#define FLEX_TWI_IDR_PECERR_Pos               _U_(19)                                              /**< (FLEX_TWI_IDR) PEC Error Interrupt Disable Position */
#define FLEX_TWI_IDR_PECERR_Msk               (_U_(0x1) << FLEX_TWI_IDR_PECERR_Pos)                /**< (FLEX_TWI_IDR) PEC Error Interrupt Disable Mask */
#define FLEX_TWI_IDR_PECERR(value)            (FLEX_TWI_IDR_PECERR_Msk & ((value) << FLEX_TWI_IDR_PECERR_Pos))
#define FLEX_TWI_IDR_SMBDAM_Pos               _U_(20)                                              /**< (FLEX_TWI_IDR) SMBus Default Address Match Interrupt Disable Position */
#define FLEX_TWI_IDR_SMBDAM_Msk               (_U_(0x1) << FLEX_TWI_IDR_SMBDAM_Pos)                /**< (FLEX_TWI_IDR) SMBus Default Address Match Interrupt Disable Mask */
#define FLEX_TWI_IDR_SMBDAM(value)            (FLEX_TWI_IDR_SMBDAM_Msk & ((value) << FLEX_TWI_IDR_SMBDAM_Pos))
#define FLEX_TWI_IDR_SMBHHM_Pos               _U_(21)                                              /**< (FLEX_TWI_IDR) SMBus Host Header Address Match Interrupt Disable Position */
#define FLEX_TWI_IDR_SMBHHM_Msk               (_U_(0x1) << FLEX_TWI_IDR_SMBHHM_Pos)                /**< (FLEX_TWI_IDR) SMBus Host Header Address Match Interrupt Disable Mask */
#define FLEX_TWI_IDR_SMBHHM(value)            (FLEX_TWI_IDR_SMBHHM_Msk & ((value) << FLEX_TWI_IDR_SMBHHM_Pos))
#define FLEX_TWI_IDR_Msk                      _U_(0x003DFFF7)                                      /**< (FLEX_TWI_IDR) Register Mask  */


/* -------- FLEX_TWI_IMR : (FLEXCOM Offset: 0x62C) ( R/ 32) TWI Interrupt Mask Register -------- */
#define FLEX_TWI_IMR_TXCOMP_Pos               _U_(0)                                               /**< (FLEX_TWI_IMR) Transmission Completed Interrupt Mask Position */
#define FLEX_TWI_IMR_TXCOMP_Msk               (_U_(0x1) << FLEX_TWI_IMR_TXCOMP_Pos)                /**< (FLEX_TWI_IMR) Transmission Completed Interrupt Mask Mask */
#define FLEX_TWI_IMR_TXCOMP(value)            (FLEX_TWI_IMR_TXCOMP_Msk & ((value) << FLEX_TWI_IMR_TXCOMP_Pos))
#define FLEX_TWI_IMR_RXRDY_Pos                _U_(1)                                               /**< (FLEX_TWI_IMR) Receive Holding Register Ready Interrupt Mask Position */
#define FLEX_TWI_IMR_RXRDY_Msk                (_U_(0x1) << FLEX_TWI_IMR_RXRDY_Pos)                 /**< (FLEX_TWI_IMR) Receive Holding Register Ready Interrupt Mask Mask */
#define FLEX_TWI_IMR_RXRDY(value)             (FLEX_TWI_IMR_RXRDY_Msk & ((value) << FLEX_TWI_IMR_RXRDY_Pos))
#define FLEX_TWI_IMR_TXRDY_Pos                _U_(2)                                               /**< (FLEX_TWI_IMR) Transmit Holding Register Ready Interrupt Mask Position */
#define FLEX_TWI_IMR_TXRDY_Msk                (_U_(0x1) << FLEX_TWI_IMR_TXRDY_Pos)                 /**< (FLEX_TWI_IMR) Transmit Holding Register Ready Interrupt Mask Mask */
#define FLEX_TWI_IMR_TXRDY(value)             (FLEX_TWI_IMR_TXRDY_Msk & ((value) << FLEX_TWI_IMR_TXRDY_Pos))
#define FLEX_TWI_IMR_SVACC_Pos                _U_(4)                                               /**< (FLEX_TWI_IMR) Slave Access Interrupt Mask Position */
#define FLEX_TWI_IMR_SVACC_Msk                (_U_(0x1) << FLEX_TWI_IMR_SVACC_Pos)                 /**< (FLEX_TWI_IMR) Slave Access Interrupt Mask Mask */
#define FLEX_TWI_IMR_SVACC(value)             (FLEX_TWI_IMR_SVACC_Msk & ((value) << FLEX_TWI_IMR_SVACC_Pos))
#define FLEX_TWI_IMR_GACC_Pos                 _U_(5)                                               /**< (FLEX_TWI_IMR) General Call Access Interrupt Mask Position */
#define FLEX_TWI_IMR_GACC_Msk                 (_U_(0x1) << FLEX_TWI_IMR_GACC_Pos)                  /**< (FLEX_TWI_IMR) General Call Access Interrupt Mask Mask */
#define FLEX_TWI_IMR_GACC(value)              (FLEX_TWI_IMR_GACC_Msk & ((value) << FLEX_TWI_IMR_GACC_Pos))
#define FLEX_TWI_IMR_OVRE_Pos                 _U_(6)                                               /**< (FLEX_TWI_IMR) Overrun Error Interrupt Mask Position */
#define FLEX_TWI_IMR_OVRE_Msk                 (_U_(0x1) << FLEX_TWI_IMR_OVRE_Pos)                  /**< (FLEX_TWI_IMR) Overrun Error Interrupt Mask Mask */
#define FLEX_TWI_IMR_OVRE(value)              (FLEX_TWI_IMR_OVRE_Msk & ((value) << FLEX_TWI_IMR_OVRE_Pos))
#define FLEX_TWI_IMR_UNRE_Pos                 _U_(7)                                               /**< (FLEX_TWI_IMR) Underrun Error Interrupt Mask Position */
#define FLEX_TWI_IMR_UNRE_Msk                 (_U_(0x1) << FLEX_TWI_IMR_UNRE_Pos)                  /**< (FLEX_TWI_IMR) Underrun Error Interrupt Mask Mask */
#define FLEX_TWI_IMR_UNRE(value)              (FLEX_TWI_IMR_UNRE_Msk & ((value) << FLEX_TWI_IMR_UNRE_Pos))
#define FLEX_TWI_IMR_NACK_Pos                 _U_(8)                                               /**< (FLEX_TWI_IMR) Not Acknowledge Interrupt Mask Position */
#define FLEX_TWI_IMR_NACK_Msk                 (_U_(0x1) << FLEX_TWI_IMR_NACK_Pos)                  /**< (FLEX_TWI_IMR) Not Acknowledge Interrupt Mask Mask */
#define FLEX_TWI_IMR_NACK(value)              (FLEX_TWI_IMR_NACK_Msk & ((value) << FLEX_TWI_IMR_NACK_Pos))
#define FLEX_TWI_IMR_ARBLST_Pos               _U_(9)                                               /**< (FLEX_TWI_IMR) Arbitration Lost Interrupt Mask Position */
#define FLEX_TWI_IMR_ARBLST_Msk               (_U_(0x1) << FLEX_TWI_IMR_ARBLST_Pos)                /**< (FLEX_TWI_IMR) Arbitration Lost Interrupt Mask Mask */
#define FLEX_TWI_IMR_ARBLST(value)            (FLEX_TWI_IMR_ARBLST_Msk & ((value) << FLEX_TWI_IMR_ARBLST_Pos))
#define FLEX_TWI_IMR_SCL_WS_Pos               _U_(10)                                              /**< (FLEX_TWI_IMR) Clock Wait State Interrupt Mask Position */
#define FLEX_TWI_IMR_SCL_WS_Msk               (_U_(0x1) << FLEX_TWI_IMR_SCL_WS_Pos)                /**< (FLEX_TWI_IMR) Clock Wait State Interrupt Mask Mask */
#define FLEX_TWI_IMR_SCL_WS(value)            (FLEX_TWI_IMR_SCL_WS_Msk & ((value) << FLEX_TWI_IMR_SCL_WS_Pos))
#define FLEX_TWI_IMR_EOSACC_Pos               _U_(11)                                              /**< (FLEX_TWI_IMR) End Of Slave Access Interrupt Mask Position */
#define FLEX_TWI_IMR_EOSACC_Msk               (_U_(0x1) << FLEX_TWI_IMR_EOSACC_Pos)                /**< (FLEX_TWI_IMR) End Of Slave Access Interrupt Mask Mask */
#define FLEX_TWI_IMR_EOSACC(value)            (FLEX_TWI_IMR_EOSACC_Msk & ((value) << FLEX_TWI_IMR_EOSACC_Pos))
#define FLEX_TWI_IMR_ENDRX_Pos                _U_(12)                                              /**< (FLEX_TWI_IMR) End of Receive Buffer Interrupt Mask Position */
#define FLEX_TWI_IMR_ENDRX_Msk                (_U_(0x1) << FLEX_TWI_IMR_ENDRX_Pos)                 /**< (FLEX_TWI_IMR) End of Receive Buffer Interrupt Mask Mask */
#define FLEX_TWI_IMR_ENDRX(value)             (FLEX_TWI_IMR_ENDRX_Msk & ((value) << FLEX_TWI_IMR_ENDRX_Pos))
#define FLEX_TWI_IMR_ENDTX_Pos                _U_(13)                                              /**< (FLEX_TWI_IMR) End of Transmit Buffer Interrupt Mask Position */
#define FLEX_TWI_IMR_ENDTX_Msk                (_U_(0x1) << FLEX_TWI_IMR_ENDTX_Pos)                 /**< (FLEX_TWI_IMR) End of Transmit Buffer Interrupt Mask Mask */
#define FLEX_TWI_IMR_ENDTX(value)             (FLEX_TWI_IMR_ENDTX_Msk & ((value) << FLEX_TWI_IMR_ENDTX_Pos))
#define FLEX_TWI_IMR_RXBUFF_Pos               _U_(14)                                              /**< (FLEX_TWI_IMR) Receive Buffer Full Interrupt Mask Position */
#define FLEX_TWI_IMR_RXBUFF_Msk               (_U_(0x1) << FLEX_TWI_IMR_RXBUFF_Pos)                /**< (FLEX_TWI_IMR) Receive Buffer Full Interrupt Mask Mask */
#define FLEX_TWI_IMR_RXBUFF(value)            (FLEX_TWI_IMR_RXBUFF_Msk & ((value) << FLEX_TWI_IMR_RXBUFF_Pos))
#define FLEX_TWI_IMR_TXBUFE_Pos               _U_(15)                                              /**< (FLEX_TWI_IMR) Transmit Buffer Empty Interrupt Mask Position */
#define FLEX_TWI_IMR_TXBUFE_Msk               (_U_(0x1) << FLEX_TWI_IMR_TXBUFE_Pos)                /**< (FLEX_TWI_IMR) Transmit Buffer Empty Interrupt Mask Mask */
#define FLEX_TWI_IMR_TXBUFE(value)            (FLEX_TWI_IMR_TXBUFE_Msk & ((value) << FLEX_TWI_IMR_TXBUFE_Pos))
#define FLEX_TWI_IMR_MCACK_Pos                _U_(16)                                              /**< (FLEX_TWI_IMR) Master Code Acknowledge Interrupt Mask Position */
#define FLEX_TWI_IMR_MCACK_Msk                (_U_(0x1) << FLEX_TWI_IMR_MCACK_Pos)                 /**< (FLEX_TWI_IMR) Master Code Acknowledge Interrupt Mask Mask */
#define FLEX_TWI_IMR_MCACK(value)             (FLEX_TWI_IMR_MCACK_Msk & ((value) << FLEX_TWI_IMR_MCACK_Pos))
#define FLEX_TWI_IMR_TOUT_Pos                 _U_(18)                                              /**< (FLEX_TWI_IMR) Timeout Error Interrupt Mask Position */
#define FLEX_TWI_IMR_TOUT_Msk                 (_U_(0x1) << FLEX_TWI_IMR_TOUT_Pos)                  /**< (FLEX_TWI_IMR) Timeout Error Interrupt Mask Mask */
#define FLEX_TWI_IMR_TOUT(value)              (FLEX_TWI_IMR_TOUT_Msk & ((value) << FLEX_TWI_IMR_TOUT_Pos))
#define FLEX_TWI_IMR_PECERR_Pos               _U_(19)                                              /**< (FLEX_TWI_IMR) PEC Error Interrupt Mask Position */
#define FLEX_TWI_IMR_PECERR_Msk               (_U_(0x1) << FLEX_TWI_IMR_PECERR_Pos)                /**< (FLEX_TWI_IMR) PEC Error Interrupt Mask Mask */
#define FLEX_TWI_IMR_PECERR(value)            (FLEX_TWI_IMR_PECERR_Msk & ((value) << FLEX_TWI_IMR_PECERR_Pos))
#define FLEX_TWI_IMR_SMBDAM_Pos               _U_(20)                                              /**< (FLEX_TWI_IMR) SMBus Default Address Match Interrupt Mask Position */
#define FLEX_TWI_IMR_SMBDAM_Msk               (_U_(0x1) << FLEX_TWI_IMR_SMBDAM_Pos)                /**< (FLEX_TWI_IMR) SMBus Default Address Match Interrupt Mask Mask */
#define FLEX_TWI_IMR_SMBDAM(value)            (FLEX_TWI_IMR_SMBDAM_Msk & ((value) << FLEX_TWI_IMR_SMBDAM_Pos))
#define FLEX_TWI_IMR_SMBHHM_Pos               _U_(21)                                              /**< (FLEX_TWI_IMR) SMBus Host Header Address Match Interrupt Mask Position */
#define FLEX_TWI_IMR_SMBHHM_Msk               (_U_(0x1) << FLEX_TWI_IMR_SMBHHM_Pos)                /**< (FLEX_TWI_IMR) SMBus Host Header Address Match Interrupt Mask Mask */
#define FLEX_TWI_IMR_SMBHHM(value)            (FLEX_TWI_IMR_SMBHHM_Msk & ((value) << FLEX_TWI_IMR_SMBHHM_Pos))
#define FLEX_TWI_IMR_Msk                      _U_(0x003DFFF7)                                      /**< (FLEX_TWI_IMR) Register Mask  */


/* -------- FLEX_TWI_RHR : (FLEXCOM Offset: 0x630) ( R/ 32) TWI Receive Holding Register -------- */
#define FLEX_TWI_RHR_RXDATA_Pos               _U_(0)                                               /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data Position */
#define FLEX_TWI_RHR_RXDATA_Msk               (_U_(0xFF) << FLEX_TWI_RHR_RXDATA_Pos)               /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data Mask */
#define FLEX_TWI_RHR_RXDATA(value)            (FLEX_TWI_RHR_RXDATA_Msk & ((value) << FLEX_TWI_RHR_RXDATA_Pos))
#define FLEX_TWI_RHR_Msk                      _U_(0x000000FF)                                      /**< (FLEX_TWI_RHR) Register Mask  */

/* FIFO_ENABLED mode */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA0_Pos _U_(0)                                               /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data 0 Position */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA0_Msk (_U_(0xFF) << FLEX_TWI_RHR_FIFO_ENABLED_RXDATA0_Pos) /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data 0 Mask */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA0(value) (FLEX_TWI_RHR_FIFO_ENABLED_RXDATA0_Msk & ((value) << FLEX_TWI_RHR_FIFO_ENABLED_RXDATA0_Pos))
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA1_Pos _U_(8)                                               /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data 1 Position */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA1_Msk (_U_(0xFF) << FLEX_TWI_RHR_FIFO_ENABLED_RXDATA1_Pos) /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data 1 Mask */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA1(value) (FLEX_TWI_RHR_FIFO_ENABLED_RXDATA1_Msk & ((value) << FLEX_TWI_RHR_FIFO_ENABLED_RXDATA1_Pos))
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA2_Pos _U_(16)                                              /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data 2 Position */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA2_Msk (_U_(0xFF) << FLEX_TWI_RHR_FIFO_ENABLED_RXDATA2_Pos) /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data 2 Mask */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA2(value) (FLEX_TWI_RHR_FIFO_ENABLED_RXDATA2_Msk & ((value) << FLEX_TWI_RHR_FIFO_ENABLED_RXDATA2_Pos))
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA3_Pos _U_(24)                                              /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data 3 Position */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA3_Msk (_U_(0xFF) << FLEX_TWI_RHR_FIFO_ENABLED_RXDATA3_Pos) /**< (FLEX_TWI_RHR) Master or Slave Receive Holding Data 3 Mask */
#define FLEX_TWI_RHR_FIFO_ENABLED_RXDATA3(value) (FLEX_TWI_RHR_FIFO_ENABLED_RXDATA3_Msk & ((value) << FLEX_TWI_RHR_FIFO_ENABLED_RXDATA3_Pos))
#define FLEX_TWI_RHR_FIFO_ENABLED_Msk         _U_(0xFFFFFFFF)                                       /**< (FLEX_TWI_RHR_FIFO_ENABLED) Register Mask  */


